RQ4/exe3/mnss_nonleader_crash_rps1_run5/k6.log
 Container oracle-lab-k6-run-2969fcf60fa8 Creating 
 Container oracle-lab-k6-run-2969fcf60fa8 Created 

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/publish.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 3m30s max duration (incl. graceful stop):
              * fixed_rate: 1.00 iterations/s for 3m0s (maxVUs: 20-100, gracefulStop: 30s)

time="2026-03-21T02:51:56Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m01.0s), 000/020 VUs, 1 complete and 0 interrupted iterations
fixed_rate   [   1% ] 000/020 VUs  0m01.0s/3m0s  1.00 iters/s
time="2026-03-21T02:51:57Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m02.0s), 000/020 VUs, 2 complete and 0 interrupted iterations
fixed_rate   [   1% ] 000/020 VUs  0m02.0s/3m0s  1.00 iters/s
time="2026-03-21T02:51:58Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m03.0s), 000/020 VUs, 3 complete and 0 interrupted iterations
fixed_rate   [   2% ] 000/020 VUs  0m03.0s/3m0s  1.00 iters/s
time="2026-03-21T02:51:59Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m04.0s), 000/020 VUs, 4 complete and 0 interrupted iterations
fixed_rate   [   2% ] 000/020 VUs  0m04.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:00Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m05.0s), 001/020 VUs, 4 complete and 0 interrupted iterations
fixed_rate   [   3% ] 001/020 VUs  0m05.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:01Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m06.0s), 000/020 VUs, 6 complete and 0 interrupted iterations
fixed_rate   [   3% ] 000/020 VUs  0m06.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:02Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m07.0s), 000/020 VUs, 7 complete and 0 interrupted iterations
fixed_rate   [   4% ] 000/020 VUs  0m07.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:03Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m08.0s), 000/020 VUs, 8 complete and 0 interrupted iterations
fixed_rate   [   4% ] 000/020 VUs  0m08.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:04Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m09.0s), 001/020 VUs, 8 complete and 0 interrupted iterations
fixed_rate   [   5% ] 001/020 VUs  0m09.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:05Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m10.0s), 000/020 VUs, 10 complete and 0 interrupted iterations
fixed_rate   [   6% ] 000/020 VUs  0m10.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:06Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m11.0s), 001/020 VUs, 10 complete and 0 interrupted iterations
fixed_rate   [   6% ] 001/020 VUs  0m11.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:07Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m12.0s), 001/020 VUs, 11 complete and 0 interrupted iterations
fixed_rate   [   7% ] 001/020 VUs  0m12.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:08Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m13.0s), 001/020 VUs, 12 complete and 0 interrupted iterations
fixed_rate   [   7% ] 001/020 VUs  0m13.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:09Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m14.0s), 001/020 VUs, 13 complete and 0 interrupted iterations
fixed_rate   [   8% ] 001/020 VUs  0m14.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:10Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m15.0s), 001/020 VUs, 14 complete and 0 interrupted iterations
fixed_rate   [   8% ] 001/020 VUs  0m15.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:11Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m16.0s), 001/020 VUs, 15 complete and 0 interrupted iterations
fixed_rate   [   9% ] 001/020 VUs  0m16.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:12Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m17.0s), 001/020 VUs, 16 complete and 0 interrupted iterations
fixed_rate   [   9% ] 001/020 VUs  0m17.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:13Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m18.0s), 001/020 VUs, 17 complete and 0 interrupted iterations
fixed_rate   [  10% ] 001/020 VUs  0m18.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:14Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m19.0s), 001/020 VUs, 18 complete and 0 interrupted iterations
fixed_rate   [  11% ] 001/020 VUs  0m19.0s/3m0s  1.00 iters/s
time="2026-03-21T02:52:15Z" level=info msg="[INFO] effective data source urls for current request: [\"http://host.docker.internal:8080/\"]; esCount=1" source=console

running (0m20.0s), 001/020 VUs, 19 complete and 0 interrupted iterations
fixed_rate   [  11% ] 001/020 VUs  0m20.0s/3m0s  1.00 iters/s

running (0m21.0s), 001/020 VUs, 20 complete and 0 interrupted iterations
fixed_rate   [  12% ] 001/020 VUs  0m21.0s/3m0s  1.00 iters/s

running (0m22.0s), 001/020 VUs, 21 complete and 0 interrupted iterations
fixed_rate   [  12% ] 001/020 VUs  0m22.0s/3m0s  1.00 iters/s

running (0m23.0s), 001/020 VUs, 22 complete and 0 interrupted iterations
fixed_rate   [  13% ] 001/020 VUs  0m23.0s/3m0s  1.00 iters/s

running (0m24.0s), 001/020 VUs, 23 complete and 0 interrupted iterations
fixed_rate   [  13% ] 001/020 VUs  0m24.0s/3m0s  1.00 iters/s

running (0m25.0s), 001/020 VUs, 24 complete and 0 interrupted iterations
fixed_rate   [  14% ] 001/020 VUs  0m25.0s/3m0s  1.00 iters/s

running (0m26.0s), 001/020 VUs, 25 complete and 0 interrupted iterations
fixed_rate   [  14% ] 001/020 VUs  0m26.0s/3m0s  1.00 iters/s

running (0m27.0s), 001/020 VUs, 26 complete and 0 interrupted iterations
fixed_rate   [  15% ] 001/020 VUs  0m27.0s/3m0s  1.00 iters/s

running (0m28.0s), 001/020 VUs, 27 complete and 0 interrupted iterations
fixed_rate   [  16% ] 001/020 VUs  0m28.0s/3m0s  1.00 iters/s

running (0m29.0s), 001/020 VUs, 28 complete and 0 interrupted iterations
fixed_rate   [  16% ] 001/020 VUs  0m29.0s/3m0s  1.00 iters/s

running (0m30.0s), 001/020 VUs, 29 complete and 0 interrupted iterations
fixed_rate   [  17% ] 001/020 VUs  0m30.0s/3m0s  1.00 iters/s

running (0m31.0s), 001/020 VUs, 30 complete and 0 interrupted iterations
fixed_rate   [  17% ] 001/020 VUs  0m31.0s/3m0s  1.00 iters/s

running (0m32.0s), 000/020 VUs, 32 complete and 0 interrupted iterations
fixed_rate   [  18% ] 000/020 VUs  0m32.0s/3m0s  1.00 iters/s

running (0m33.0s), 001/020 VUs, 32 complete and 0 interrupted iterations
fixed_rate   [  18% ] 001/020 VUs  0m33.0s/3m0s  1.00 iters/s

running (0m34.0s), 000/020 VUs, 34 complete and 0 interrupted iterations
fixed_rate   [  19% ] 000/020 VUs  0m34.0s/3m0s  1.00 iters/s

running (0m35.0s), 001/020 VUs, 34 complete and 0 interrupted iterations
fixed_rate   [  19% ] 001/020 VUs  0m35.0s/3m0s  1.00 iters/s

running (0m36.0s), 000/020 VUs, 36 complete and 0 interrupted iterations
fixed_rate   [  20% ] 000/020 VUs  0m36.0s/3m0s  1.00 iters/s

running (0m37.0s), 000/020 VUs, 37 complete and 0 interrupted iterations
fixed_rate   [  21% ] 000/020 VUs  0m37.0s/3m0s  1.00 iters/s

running (0m38.0s), 000/020 VUs, 38 complete and 0 interrupted iterations
fixed_rate   [  21% ] 000/020 VUs  0m38.0s/3m0s  1.00 iters/s

running (0m39.0s), 001/020 VUs, 38 complete and 0 interrupted iterations
fixed_rate   [  22% ] 001/020 VUs  0m39.0s/3m0s  1.00 iters/s

running (0m40.0s), 001/020 VUs, 39 complete and 0 interrupted iterations
fixed_rate   [  22% ] 001/020 VUs  0m40.0s/3m0s  1.00 iters/s

running (0m41.0s), 001/020 VUs, 40 complete and 0 interrupted iterations
fixed_rate   [  23% ] 001/020 VUs  0m41.0s/3m0s  1.00 iters/s

running (0m42.0s), 001/020 VUs, 41 complete and 0 interrupted iterations
fixed_rate   [  23% ] 001/020 VUs  0m42.0s/3m0s  1.00 iters/s

running (0m43.0s), 001/020 VUs, 42 complete and 0 interrupted iterations
fixed_rate   [  24% ] 001/020 VUs  0m43.0s/3m0s  1.00 iters/s

running (0m44.0s), 001/020 VUs, 43 complete and 0 interrupted iterations
fixed_rate   [  24% ] 001/020 VUs  0m44.0s/3m0s  1.00 iters/s

running (0m45.0s), 001/020 VUs, 44 complete and 0 interrupted iterations
fixed_rate   [  25% ] 001/020 VUs  0m45.0s/3m0s  1.00 iters/s

running (0m46.0s), 001/020 VUs, 45 complete and 0 interrupted iterations
fixed_rate   [  26% ] 001/020 VUs  0m46.0s/3m0s  1.00 iters/s

running (0m47.0s), 001/020 VUs, 46 complete and 0 interrupted iterations
fixed_rate   [  26% ] 001/020 VUs  0m47.0s/3m0s  1.00 iters/s

running (0m48.0s), 001/020 VUs, 47 complete and 0 interrupted iterations
fixed_rate   [  27% ] 001/020 VUs  0m48.0s/3m0s  1.00 iters/s

running (0m49.0s), 000/020 VUs, 49 complete and 0 interrupted iterations
fixed_rate   [  27% ] 000/020 VUs  0m49.0s/3m0s  1.00 iters/s

running (0m50.0s), 000/020 VUs, 50 complete and 0 interrupted iterations
fixed_rate   [  28% ] 000/020 VUs  0m50.0s/3m0s  1.00 iters/s

running (0m51.0s), 001/020 VUs, 50 complete and 0 interrupted iterations
fixed_rate   [  28% ] 001/020 VUs  0m51.0s/3m0s  1.00 iters/s

running (0m52.0s), 001/020 VUs, 51 complete and 0 interrupted iterations
fixed_rate   [  29% ] 001/020 VUs  0m52.0s/3m0s  1.00 iters/s

running (0m53.0s), 000/020 VUs, 53 complete and 0 interrupted iterations
fixed_rate   [  29% ] 000/020 VUs  0m53.0s/3m0s  1.00 iters/s

running (0m54.0s), 001/020 VUs, 53 complete and 0 interrupted iterations
fixed_rate   [  30% ] 001/020 VUs  0m54.0s/3m0s  1.00 iters/s

running (0m55.0s), 000/020 VUs, 55 complete and 0 interrupted iterations
fixed_rate   [  31% ] 000/020 VUs  0m55.0s/3m0s  1.00 iters/s

running (0m56.0s), 000/020 VUs, 56 complete and 0 interrupted iterations
fixed_rate   [  31% ] 000/020 VUs  0m56.0s/3m0s  1.00 iters/s

running (0m57.0s), 000/020 VUs, 57 complete and 0 interrupted iterations
fixed_rate   [  32% ] 000/020 VUs  0m57.0s/3m0s  1.00 iters/s

running (0m58.0s), 001/020 VUs, 57 complete and 0 interrupted iterations
fixed_rate   [  32% ] 001/020 VUs  0m58.0s/3m0s  1.00 iters/s

running (0m59.0s), 001/020 VUs, 58 complete and 0 interrupted iterations
fixed_rate   [  33% ] 001/020 VUs  0m59.0s/3m0s  1.00 iters/s

running (1m00.0s), 001/020 VUs, 59 complete and 0 interrupted iterations
fixed_rate   [  33% ] 001/020 VUs  1m00.0s/3m0s  1.00 iters/s

running (1m01.0s), 001/020 VUs, 60 complete and 0 interrupted iterations
fixed_rate   [  34% ] 001/020 VUs  1m01.0s/3m0s  1.00 iters/s

running (1m02.0s), 002/020 VUs, 60 complete and 0 interrupted iterations
fixed_rate   [  34% ] 002/020 VUs  1m02.0s/3m0s  1.00 iters/s

running (1m03.0s), 003/020 VUs, 60 complete and 0 interrupted iterations
fixed_rate   [  35% ] 003/020 VUs  1m03.0s/3m0s  1.00 iters/s

running (1m04.0s), 004/020 VUs, 60 complete and 0 interrupted iterations
fixed_rate   [  36% ] 004/020 VUs  1m04.0s/3m0s  1.00 iters/s

running (1m05.0s), 005/020 VUs, 60 complete and 0 interrupted iterations
fixed_rate   [  36% ] 005/020 VUs  1m05.0s/3m0s  1.00 iters/s

running (1m06.0s), 005/020 VUs, 61 complete and 0 interrupted iterations
fixed_rate   [  37% ] 005/020 VUs  1m06.0s/3m0s  1.00 iters/s

running (1m07.0s), 005/020 VUs, 62 complete and 0 interrupted iterations
fixed_rate   [  37% ] 005/020 VUs  1m07.0s/3m0s  1.00 iters/s

running (1m08.0s), 006/020 VUs, 62 complete and 0 interrupted iterations
fixed_rate   [  38% ] 006/020 VUs  1m08.0s/3m0s  1.00 iters/s

running (1m09.0s), 006/020 VUs, 63 complete and 0 interrupted iterations
fixed_rate   [  38% ] 006/020 VUs  1m09.0s/3m0s  1.00 iters/s

running (1m10.0s), 006/020 VUs, 64 complete and 0 interrupted iterations
fixed_rate   [  39% ] 006/020 VUs  1m10.0s/3m0s  1.00 iters/s

running (1m11.0s), 007/020 VUs, 64 complete and 0 interrupted iterations
fixed_rate   [  39% ] 007/020 VUs  1m11.0s/3m0s  1.00 iters/s

running (1m12.0s), 007/020 VUs, 65 complete and 0 interrupted iterations
fixed_rate   [  40% ] 007/020 VUs  1m12.0s/3m0s  1.00 iters/s

running (1m13.0s), 007/020 VUs, 66 complete and 0 interrupted iterations
fixed_rate   [  41% ] 007/020 VUs  1m13.0s/3m0s  1.00 iters/s

running (1m14.0s), 007/020 VUs, 67 complete and 0 interrupted iterations
fixed_rate   [  41% ] 007/020 VUs  1m14.0s/3m0s  1.00 iters/s

running (1m15.0s), 007/020 VUs, 68 complete and 0 interrupted iterations
fixed_rate   [  42% ] 007/020 VUs  1m15.0s/3m0s  1.00 iters/s

running (1m16.0s), 008/020 VUs, 68 complete and 0 interrupted iterations
fixed_rate   [  42% ] 008/020 VUs  1m16.0s/3m0s  1.00 iters/s

running (1m17.0s), 008/020 VUs, 69 complete and 0 interrupted iterations
fixed_rate   [  43% ] 008/020 VUs  1m17.0s/3m0s  1.00 iters/s

running (1m18.0s), 008/020 VUs, 70 complete and 0 interrupted iterations
fixed_rate   [  43% ] 008/020 VUs  1m18.0s/3m0s  1.00 iters/s

running (1m19.0s), 008/020 VUs, 71 complete and 0 interrupted iterations
fixed_rate   [  44% ] 008/020 VUs  1m19.0s/3m0s  1.00 iters/s

running (1m20.0s), 008/020 VUs, 72 complete and 0 interrupted iterations
fixed_rate   [  44% ] 008/020 VUs  1m20.0s/3m0s  1.00 iters/s

running (1m21.0s), 009/020 VUs, 72 complete and 0 interrupted iterations
fixed_rate   [  45% ] 009/020 VUs  1m21.0s/3m0s  1.00 iters/s

running (1m22.0s), 009/020 VUs, 73 complete and 0 interrupted iterations
fixed_rate   [  46% ] 009/020 VUs  1m22.0s/3m0s  1.00 iters/s

running (1m23.0s), 009/020 VUs, 74 complete and 0 interrupted iterations
fixed_rate   [  46% ] 009/020 VUs  1m23.0s/3m0s  1.00 iters/s

running (1m24.0s), 009/020 VUs, 75 complete and 0 interrupted iterations
fixed_rate   [  47% ] 009/020 VUs  1m24.0s/3m0s  1.00 iters/s

running (1m25.0s), 009/020 VUs, 76 complete and 0 interrupted iterations
fixed_rate   [  47% ] 009/020 VUs  1m25.0s/3m0s  1.00 iters/s

running (1m26.0s), 009/020 VUs, 77 complete and 0 interrupted iterations
fixed_rate   [  48% ] 009/020 VUs  1m26.0s/3m0s  1.00 iters/s

running (1m27.0s), 009/020 VUs, 78 complete and 0 interrupted iterations
fixed_rate   [  48% ] 009/020 VUs  1m27.0s/3m0s  1.00 iters/s

running (1m28.0s), 009/020 VUs, 79 complete and 0 interrupted iterations
fixed_rate   [  49% ] 009/020 VUs  1m28.0s/3m0s  1.00 iters/s

running (1m29.0s), 009/020 VUs, 80 complete and 0 interrupted iterations
fixed_rate   [  49% ] 009/020 VUs  1m29.0s/3m0s  1.00 iters/s

running (1m30.0s), 009/020 VUs, 81 complete and 0 interrupted iterations
fixed_rate   [  50% ] 009/020 VUs  1m30.0s/3m0s  1.00 iters/s

running (1m31.0s), 009/020 VUs, 82 complete and 0 interrupted iterations
fixed_rate   [  51% ] 009/020 VUs  1m31.0s/3m0s  1.00 iters/s

running (1m32.0s), 010/020 VUs, 82 complete and 0 interrupted iterations
fixed_rate   [  51% ] 010/020 VUs  1m32.0s/3m0s  1.00 iters/s

running (1m33.0s), 009/020 VUs, 84 complete and 0 interrupted iterations
fixed_rate   [  52% ] 009/020 VUs  1m33.0s/3m0s  1.00 iters/s

running (1m34.0s), 008/020 VUs, 86 complete and 0 interrupted iterations
fixed_rate   [  52% ] 008/020 VUs  1m34.0s/3m0s  1.00 iters/s

running (1m35.0s), 008/020 VUs, 87 complete and 0 interrupted iterations
fixed_rate   [  53% ] 008/020 VUs  1m35.0s/3m0s  1.00 iters/s

running (1m36.0s), 008/020 VUs, 88 complete and 0 interrupted iterations
fixed_rate   [  53% ] 008/020 VUs  1m36.0s/3m0s  1.00 iters/s

running (1m37.0s), 008/020 VUs, 89 complete and 0 interrupted iterations
fixed_rate   [  54% ] 008/020 VUs  1m37.0s/3m0s  1.00 iters/s

running (1m38.0s), 008/020 VUs, 90 complete and 0 interrupted iterations
fixed_rate   [  54% ] 008/020 VUs  1m38.0s/3m0s  1.00 iters/s

running (1m39.0s), 007/020 VUs, 92 complete and 0 interrupted iterations
fixed_rate   [  55% ] 007/020 VUs  1m39.0s/3m0s  1.00 iters/s

running (1m40.0s), 007/020 VUs, 93 complete and 0 interrupted iterations
fixed_rate   [  56% ] 007/020 VUs  1m40.0s/3m0s  1.00 iters/s

running (1m41.0s), 006/020 VUs, 95 complete and 0 interrupted iterations
fixed_rate   [  56% ] 006/020 VUs  1m41.0s/3m0s  1.00 iters/s

running (1m42.0s), 006/020 VUs, 96 complete and 0 interrupted iterations
fixed_rate   [  57% ] 006/020 VUs  1m42.0s/3m0s  1.00 iters/s

running (1m43.0s), 006/020 VUs, 97 complete and 0 interrupted iterations
fixed_rate   [  57% ] 006/020 VUs  1m43.0s/3m0s  1.00 iters/s

running (1m44.0s), 005/020 VUs, 99 complete and 0 interrupted iterations
fixed_rate   [  58% ] 005/020 VUs  1m44.0s/3m0s  1.00 iters/s

running (1m45.0s), 005/020 VUs, 100 complete and 0 interrupted iterations
fixed_rate   [  58% ] 005/020 VUs  1m45.0s/3m0s  1.00 iters/s

running (1m46.0s), 004/020 VUs, 102 complete and 0 interrupted iterations
fixed_rate   [  59% ] 004/020 VUs  1m46.0s/3m0s  1.00 iters/s

running (1m47.0s), 004/020 VUs, 103 complete and 0 interrupted iterations
fixed_rate   [  59% ] 004/020 VUs  1m47.0s/3m0s  1.00 iters/s

running (1m48.0s), 003/020 VUs, 105 complete and 0 interrupted iterations
fixed_rate   [  60% ] 003/020 VUs  1m48.0s/3m0s  1.00 iters/s

running (1m49.0s), 003/020 VUs, 106 complete and 0 interrupted iterations
fixed_rate   [  61% ] 003/020 VUs  1m49.0s/3m0s  1.00 iters/s

running (1m50.0s), 003/020 VUs, 107 complete and 0 interrupted iterations
fixed_rate   [  61% ] 003/020 VUs  1m50.0s/3m0s  1.00 iters/s

running (1m51.0s), 003/020 VUs, 108 complete and 0 interrupted iterations
fixed_rate   [  62% ] 003/020 VUs  1m51.0s/3m0s  1.00 iters/s

running (1m52.0s), 003/020 VUs, 109 complete and 0 interrupted iterations
fixed_rate   [  62% ] 003/020 VUs  1m52.0s/3m0s  1.00 iters/s

running (1m53.0s), 003/020 VUs, 110 complete and 0 interrupted iterations
fixed_rate   [  63% ] 003/020 VUs  1m53.0s/3m0s  1.00 iters/s

running (1m54.0s), 003/020 VUs, 111 complete and 0 interrupted iterations
fixed_rate   [  63% ] 003/020 VUs  1m54.0s/3m0s  1.00 iters/s

running (1m55.0s), 003/020 VUs, 112 complete and 0 interrupted iterations
fixed_rate   [  64% ] 003/020 VUs  1m55.0s/3m0s  1.00 iters/s

running (1m56.0s), 003/020 VUs, 113 complete and 0 interrupted iterations
fixed_rate   [  64% ] 003/020 VUs  1m56.0s/3m0s  1.00 iters/s

running (1m57.0s), 002/020 VUs, 115 complete and 0 interrupted iterations
fixed_rate   [  65% ] 002/020 VUs  1m57.0s/3m0s  1.00 iters/s

running (1m58.0s), 002/020 VUs, 116 complete and 0 interrupted iterations
fixed_rate   [  66% ] 002/020 VUs  1m58.0s/3m0s  1.00 iters/s

running (1m59.0s), 002/020 VUs, 117 complete and 0 interrupted iterations
fixed_rate   [  66% ] 002/020 VUs  1m59.0s/3m0s  1.00 iters/s

running (2m00.0s), 003/020 VUs, 117 complete and 0 interrupted iterations
fixed_rate   [  67% ] 003/020 VUs  2m00.0s/3m0s  1.00 iters/s

running (2m01.0s), 003/020 VUs, 118 complete and 0 interrupted iterations
fixed_rate   [  67% ] 003/020 VUs  2m01.0s/3m0s  1.00 iters/s

running (2m02.0s), 003/020 VUs, 119 complete and 0 interrupted iterations
fixed_rate   [  68% ] 003/020 VUs  2m02.0s/3m0s  1.00 iters/s

running (2m03.0s), 002/020 VUs, 121 complete and 0 interrupted iterations
fixed_rate   [  68% ] 002/020 VUs  2m03.0s/3m0s  1.00 iters/s

running (2m04.0s), 003/020 VUs, 121 complete and 0 interrupted iterations
fixed_rate   [  69% ] 003/020 VUs  2m04.0s/3m0s  1.00 iters/s

running (2m05.0s), 002/020 VUs, 123 complete and 0 interrupted iterations
fixed_rate   [  69% ] 002/020 VUs  2m05.0s/3m0s  1.00 iters/s

running (2m06.0s), 002/020 VUs, 124 complete and 0 interrupted iterations
fixed_rate   [  70% ] 002/020 VUs  2m06.0s/3m0s  1.00 iters/s

running (2m07.0s), 002/020 VUs, 125 complete and 0 interrupted iterations
fixed_rate   [  71% ] 002/020 VUs  2m07.0s/3m0s  1.00 iters/s

running (2m08.0s), 003/020 VUs, 125 complete and 0 interrupted iterations
fixed_rate   [  71% ] 003/020 VUs  2m08.0s/3m0s  1.00 iters/s

running (2m09.0s), 002/020 VUs, 127 complete and 0 interrupted iterations
fixed_rate   [  72% ] 002/020 VUs  2m09.0s/3m0s  1.00 iters/s

running (2m10.0s), 003/020 VUs, 127 complete and 0 interrupted iterations
fixed_rate   [  72% ] 003/020 VUs  2m10.0s/3m0s  1.00 iters/s

running (2m11.0s), 002/020 VUs, 129 complete and 0 interrupted iterations
fixed_rate   [  73% ] 002/020 VUs  2m11.0s/3m0s  1.00 iters/s

running (2m12.0s), 003/020 VUs, 129 complete and 0 interrupted iterations
fixed_rate   [  73% ] 003/020 VUs  2m12.0s/3m0s  1.00 iters/s

running (2m13.0s), 002/020 VUs, 131 complete and 0 interrupted iterations
fixed_rate   [  74% ] 002/020 VUs  2m13.0s/3m0s  1.00 iters/s

running (2m14.0s), 002/020 VUs, 132 complete and 0 interrupted iterations
fixed_rate   [  74% ] 002/020 VUs  2m14.0s/3m0s  1.00 iters/s

running (2m15.0s), 003/020 VUs, 132 complete and 0 interrupted iterations
fixed_rate   [  75% ] 003/020 VUs  2m15.0s/3m0s  1.00 iters/s

running (2m16.0s), 003/020 VUs, 133 complete and 0 interrupted iterations
fixed_rate   [  76% ] 003/020 VUs  2m16.0s/3m0s  1.00 iters/s

running (2m17.0s), 002/020 VUs, 135 complete and 0 interrupted iterations
fixed_rate   [  76% ] 002/020 VUs  2m17.0s/3m0s  1.00 iters/s

running (2m18.0s), 003/020 VUs, 135 complete and 0 interrupted iterations
fixed_rate   [  77% ] 003/020 VUs  2m18.0s/3m0s  1.00 iters/s

running (2m19.0s), 003/020 VUs, 136 complete and 0 interrupted iterations
fixed_rate   [  77% ] 003/020 VUs  2m19.0s/3m0s  1.00 iters/s

running (2m20.0s), 003/020 VUs, 137 complete and 0 interrupted iterations
fixed_rate   [  78% ] 003/020 VUs  2m20.0s/3m0s  1.00 iters/s

running (2m21.0s), 003/020 VUs, 138 complete and 0 interrupted iterations
fixed_rate   [  78% ] 003/020 VUs  2m21.0s/3m0s  1.00 iters/s

running (2m22.0s), 002/020 VUs, 140 complete and 0 interrupted iterations
fixed_rate   [  79% ] 002/020 VUs  2m22.0s/3m0s  1.00 iters/s

running (2m23.0s), 002/020 VUs, 141 complete and 0 interrupted iterations
fixed_rate   [  79% ] 002/020 VUs  2m23.0s/3m0s  1.00 iters/s

running (2m24.0s), 002/020 VUs, 142 complete and 0 interrupted iterations
fixed_rate   [  80% ] 002/020 VUs  2m24.0s/3m0s  1.00 iters/s

running (2m25.0s), 003/020 VUs, 142 complete and 0 interrupted iterations
fixed_rate   [  81% ] 003/020 VUs  2m25.0s/3m0s  1.00 iters/s

running (2m26.0s), 003/020 VUs, 143 complete and 0 interrupted iterations
fixed_rate   [  81% ] 003/020 VUs  2m26.0s/3m0s  1.00 iters/s

running (2m27.0s), 003/020 VUs, 144 complete and 0 interrupted iterations
fixed_rate   [  82% ] 003/020 VUs  2m27.0s/3m0s  1.00 iters/s

running (2m28.0s), 003/020 VUs, 145 complete and 0 interrupted iterations
fixed_rate   [  82% ] 003/020 VUs  2m28.0s/3m0s  1.00 iters/s

running (2m29.0s), 003/020 VUs, 146 complete and 0 interrupted iterations
fixed_rate   [  83% ] 003/020 VUs  2m29.0s/3m0s  1.00 iters/s

running (2m30.0s), 003/020 VUs, 147 complete and 0 interrupted iterations
fixed_rate   [  83% ] 003/020 VUs  2m30.0s/3m0s  1.00 iters/s

running (2m31.0s), 003/020 VUs, 148 complete and 0 interrupted iterations
fixed_rate   [  84% ] 003/020 VUs  2m31.0s/3m0s  1.00 iters/s

running (2m32.0s), 003/020 VUs, 149 complete and 0 interrupted iterations
fixed_rate   [  84% ] 003/020 VUs  2m32.0s/3m0s  1.00 iters/s

running (2m33.0s), 002/020 VUs, 151 complete and 0 interrupted iterations
fixed_rate   [  85% ] 002/020 VUs  2m33.0s/3m0s  1.00 iters/s

running (2m34.0s), 003/020 VUs, 151 complete and 0 interrupted iterations
fixed_rate   [  86% ] 003/020 VUs  2m34.0s/3m0s  1.00 iters/s

running (2m35.0s), 002/020 VUs, 153 complete and 0 interrupted iterations
fixed_rate   [  86% ] 002/020 VUs  2m35.0s/3m0s  1.00 iters/s

running (2m36.0s), 002/020 VUs, 154 complete and 0 interrupted iterations
fixed_rate   [  87% ] 002/020 VUs  2m36.0s/3m0s  1.00 iters/s

running (2m37.0s), 002/020 VUs, 155 complete and 0 interrupted iterations
fixed_rate   [  87% ] 002/020 VUs  2m37.0s/3m0s  1.00 iters/s

running (2m38.0s), 002/020 VUs, 156 complete and 0 interrupted iterations
fixed_rate   [  88% ] 002/020 VUs  2m38.0s/3m0s  1.00 iters/s

running (2m39.0s), 002/020 VUs, 157 complete and 0 interrupted iterations
fixed_rate   [  88% ] 002/020 VUs  2m39.0s/3m0s  1.00 iters/s

running (2m40.0s), 002/020 VUs, 158 complete and 0 interrupted iterations
fixed_rate   [  89% ] 002/020 VUs  2m40.0s/3m0s  1.00 iters/s

running (2m41.0s), 001/020 VUs, 160 complete and 0 interrupted iterations
fixed_rate   [  89% ] 001/020 VUs  2m41.0s/3m0s  1.00 iters/s

running (2m42.0s), 001/020 VUs, 161 complete and 0 interrupted iterations
fixed_rate   [  90% ] 001/020 VUs  2m42.0s/3m0s  1.00 iters/s

running (2m43.0s), 001/020 VUs, 162 complete and 0 interrupted iterations
fixed_rate   [  91% ] 001/020 VUs  2m43.0s/3m0s  1.00 iters/s

running (2m44.0s), 002/020 VUs, 162 complete and 0 interrupted iterations
fixed_rate   [  91% ] 002/020 VUs  2m44.0s/3m0s  1.00 iters/s

running (2m45.0s), 001/020 VUs, 164 complete and 0 interrupted iterations
fixed_rate   [  92% ] 001/020 VUs  2m45.0s/3m0s  1.00 iters/s

running (2m46.0s), 001/020 VUs, 165 complete and 0 interrupted iterations
fixed_rate   [  92% ] 001/020 VUs  2m46.0s/3m0s  1.00 iters/s

running (2m47.0s), 002/020 VUs, 165 complete and 0 interrupted iterations
fixed_rate   [  93% ] 002/020 VUs  2m47.0s/3m0s  1.00 iters/s

running (2m48.0s), 002/020 VUs, 166 complete and 0 interrupted iterations
fixed_rate   [  93% ] 002/020 VUs  2m48.0s/3m0s  1.00 iters/s

running (2m49.0s), 002/020 VUs, 167 complete and 0 interrupted iterations
fixed_rate   [  94% ] 002/020 VUs  2m49.0s/3m0s  1.00 iters/s

running (2m50.0s), 001/020 VUs, 169 complete and 0 interrupted iterations
fixed_rate   [  94% ] 001/020 VUs  2m50.0s/3m0s  1.00 iters/s

running (2m51.0s), 001/020 VUs, 170 complete and 0 interrupted iterations
fixed_rate   [  95% ] 001/020 VUs  2m51.0s/3m0s  1.00 iters/s

running (2m52.0s), 001/020 VUs, 171 complete and 0 interrupted iterations
fixed_rate   [  96% ] 001/020 VUs  2m52.0s/3m0s  1.00 iters/s

running (2m53.0s), 001/020 VUs, 172 complete and 0 interrupted iterations
fixed_rate   [  96% ] 001/020 VUs  2m53.0s/3m0s  1.00 iters/s

running (2m54.0s), 002/020 VUs, 172 complete and 0 interrupted iterations
fixed_rate   [  97% ] 002/020 VUs  2m54.0s/3m0s  1.00 iters/s

running (2m55.0s), 001/020 VUs, 174 complete and 0 interrupted iterations
fixed_rate   [  97% ] 001/020 VUs  2m55.0s/3m0s  1.00 iters/s

running (2m56.0s), 001/020 VUs, 175 complete and 0 interrupted iterations
fixed_rate   [  98% ] 001/020 VUs  2m56.0s/3m0s  1.00 iters/s

running (2m57.0s), 001/020 VUs, 176 complete and 0 interrupted iterations
fixed_rate   [  98% ] 001/020 VUs  2m57.0s/3m0s  1.00 iters/s

running (2m58.0s), 001/020 VUs, 177 complete and 0 interrupted iterations
fixed_rate   [  99% ] 001/020 VUs  2m58.0s/3m0s  1.00 iters/s

running (2m59.0s), 001/020 VUs, 178 complete and 0 interrupted iterations
fixed_rate   [  99% ] 001/020 VUs  2m59.0s/3m0s  1.00 iters/s

running (3m00.0s), 000/020 VUs, 180 complete and 0 interrupted iterations
fixed_rate   [ 100% ] 000/020 VUs  3m00.0s/3m0s  1.00 iters/s

     ✓ publish status 200

     checks.........................: 100.00% 181 out of 181
     data_received..................: 27 kB   150 B/s
     data_sent......................: 76 kB   421 B/s
     http_req_blocked...............: avg=77.45µs  min=10.9µs   med=13.78µs  max=1.34ms   p(90)=426.38µs p(95)=492.63µs
     http_req_connecting............: avg=43.73µs  min=0s       med=0s       max=1.04ms   p(90)=246.87µs p(95)=341.25µs
     http_req_duration..............: avg=3.39s    min=397.39ms med=2.62s    max=10s      p(90)=8.5s     p(95)=9.21s   
       { expected_response:true }...: avg=3.39s    min=397.39ms med=2.62s    max=10s      p(90)=8.5s     p(95)=9.21s   
     http_req_failed................: 0.00%   0 out of 181
     http_req_receiving.............: avg=141.99µs min=97.38µs  med=135.22µs max=276.76µs p(90)=179.16µs p(95)=192.92µs
     http_req_sending...............: avg=69.4µs   min=34.86µs  med=55.79µs  max=367.93µs p(90)=101.04µs p(95)=149.94µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=3.39s    min=397.12ms med=2.62s    max=10s      p(90)=8.5s     p(95)=9.21s   
     http_reqs......................: 181     1.000153/s
     iteration_duration.............: avg=3.4s     min=410.69ms med=2.63s    max=10.01s   p(90)=8.51s    p(95)=9.22s   
     iterations.....................: 181     1.000153/s
     vus............................: 0       min=0          max=10
     vus_max........................: 20      min=20         max=20


running (3m01.0s), 000/020 VUs, 181 complete and 0 interrupted iterations
fixed_rate ✓ [ 100% ] 000/020 VUs  3m0s  1.00 iters/s